xl170(broadwell)_not_consolidated_4core_4iothread/multiplier_32/run5.txt
# run=5/10
# 2026-04-03T00:58:18-06:00
# cmd: taskset -c 1-19 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            566286
        write:                           147011
        other:                           75495
        total:                           788792
    transactions:                        35046  (583.77 per sec.)
    queries:                             788792 (13139.01 per sec.)
    ignored errors:                      5403   (90.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      583.7659
    time elapsed:                        60.0343s
    total number of events:              35046

Latency (ms):
         min:                                    2.54
         avg:                                   54.80
         max:                                  321.26
         95th percentile:                      116.80
         sum:                              1920447.43

Threads fairness:
    events (avg/stddev):           1095.1875/15.88
    execution time (avg/stddev):   60.0140/0.01